modm-ext/data.modm.io/docs/svd/header_stm32wb10xx.svd
        <register>
          <name>BKP8R</name>
          <description>RTC backup register 8</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP8R</name>
              <description>RTC backup register 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP9R</name>
          <description>RTC backup register 9</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP9R</name>
              <description>RTC backup register 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP10R</name>
          <description>RTC backup register 10</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP10R</name>
              <description>RTC backup register 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP11R</name>
          <description>RTC backup register 11</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP11R</name>
              <description>RTC backup register 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP12R</name>
          <description>RTC backup register 12</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP12R</name>
              <description>RTC backup register 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP13R</name>
          <description>RTC backup register 13</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP13R</name>
              <description>RTC backup register 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP14R</name>
          <description>RTC backup register 14</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP14R</name>
              <description>RTC backup register 14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP15R</name>
          <description>RTC backup register 15</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP15R</name>
              <description>RTC backup register 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP16R</name>
          <description>RTC backup register 16</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP16R</name>
              <description>RTC backup register 16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP17R</name>
          <description>RTC backup register 17</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP17R</name>
              <description>RTC backup register 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP18R</name>
          <description>RTC backup register 18</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP18R</name>
              <description>RTC backup register 18</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKP19R</name>
          <description>RTC backup register 19</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKP19R</name>
              <description>RTC backup register 19</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDG</name>
      <description>Window WATCHDOG</description>
      <baseAddress>0x40002c00</baseAddress>
      <interrupt>
        <name>WWDG</name>
        <description>Window WatchDog Interrupt</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>WWDG Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>T</name>
              <description>T[6:0] bits (7-Bit counter (MSB to LSB))</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>WDGA</name>
              <description>Activation bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <description>WWDG Configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>W</name>
              <description>W[6:0] bits (7-bit window value)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>EWI</name>
              <description>Early Wakeup Interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDGTB</name>
              <description>WDGTB[2:0] bits (Timer Base)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PRESCALER_1</name>
                  <description>WWDG counter clock = (PCLK1/4096)/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_2</name>
                  <description>WWDG counter clock = (PCLK1/4096)/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_4</name>
                  <description>WWDG counter clock = (PCLK1/4096)/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_8</name>
                  <description>WWDG counter clock = (PCLK1/4096)/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_16</name>
                  <description>WWDG counter clock = (PCLK1/4096)/16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_32</name>
                  <description>WWDG counter clock = (PCLK1/4096)/32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_64</name>
                  <description>WWDG counter clock = (PCLK1/4096)/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESCALER_128</name>
                  <description>WWDG counter clock = (PCLK1/4096)/128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>WWDG Status register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EWIF</name>
              <description>Early Wakeup Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
