modm-ext/data.modm.io/docs/svd/header_stm32wb10xx.svd
        <register>
          <name>PDCRB</name>
          <description>PWR Pull-Down Control Register of port B</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin PB0 Pull-Down set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin PB1 Pull-Down set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin PB2 Pull-Down set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin PB3 Pull-Down set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin PB5 Pull-Down set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin PB6 Pull-Down set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin PB7 Pull-Down set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB8</name>
              <description>Pin PB8 Pull-Down set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PB9</name>
              <description>Pin PB9 Pull-Down set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRC</name>
          <description>PWR Pull-Up Control Register of port C</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PC14</name>
              <description>Pin PC14 Pull-Up set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC15</name>
              <description>Pin PC15 Pull-Up set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRC</name>
          <description>PWR Pull-Down Control Register of port C</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PC14</name>
              <description>Pin PC14 Pull-Down set</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PC15</name>
              <description>Pin PC15 Pull-Down set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRE</name>
          <description>PWR Pull-Up Control Register of port E</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PE4</name>
              <description>Pin PE4 Pull-Up set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRE</name>
          <description>PWR Pull-Down Control Register of port E</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PE4</name>
              <description>Pin PE4 Pull-Down set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRH</name>
          <description>PWR Pull-Up Control Register of port H</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PH3</name>
              <description>Pin PH3 Pull-Up set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRH</name>
          <description>PWR Pull-Down Control Register of port H</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PH3</name>
              <description>Pin PH3 Pull-Down set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CR1</name>
          <description>PWR Power Control Register 1 for CPU2</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPMS</name>
              <description>Low Power Mode Selection for CPU2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP0</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPDR</name>
              <description>Flash power down mode during LPrun for CPU2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPDS</name>
              <description>Flash power down mode during LPsleep for CPU2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWER_DOWN</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLEEWKUP</name>
              <description>Radio BLE external wakeup signal</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CR3</name>
          <description>PWR Power Control Register 3 for CPU2</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EWUP1</name>
              <description>Enable external WKUP Pin 1 [line 0] for CPU2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP4</name>
              <description>Enable external WKUP Pin 4 [line 3] for CPU2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EBLEWUP</name>
              <description>Enable BLE host wakeup interrupt for CPU2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APC</name>
              <description>Apply pull-up and pull-down configuration for CPU2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIWUL</name>
              <description>Internal Wake-Up line interrupt for CPU2</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTSCR</name>
          <description>PWR Power Status Reset Register for CPU2</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>C1CSSF</name>
              <description>Clear standby and stop flags for CPU1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2CSSF</name>
              <description>Clear standby and stop flags for CPU2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCRPF</name>
              <description>Clear critical radio system phase flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1SBF</name>
              <description>System standby flag for CPU1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1STOPF</name>
              <description>System stop flag for CPU1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2SBF</name>
              <description>System standby flag for CPU2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2STOPF</name>
              <description>System stop flag for CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRPF</name>
              <description>Critical radio system phase flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1DS</name>
              <description>CPU1 deepsleep mode flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C2DS</name>
              <description>CPU2 deepsleep mode flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
